In [3]:
import pandas as pd

In [51]:
data={'apple':[3,2,0,1,5],'orange':[1,4,5,9,6]}
df=pd.DataFrame(data)
print(df)

   apple  orange
0      3       1
1      2       4
2      0       5
3      1       9
4      5       6

In [9]:
data={'apple':[3,2,0,1,5],'orange':[1,4,5,9,6]}
df=pd.DataFrame(data,index=[1,2,3,4,5])
print(df)

   apple  orange
1      3       1
2      2       4
3      0       5
4      1       9
5      5       6

In [11]:
df.loc[4]

apple     1
orange    9
Name: 4, dtype: int64

In [12]:
data={'apple':[3,2,0,1,5],'orange':[1,4,5,9,6]}
df=pd.DataFrame.from_dict(data)
print(df)

   apple  orange
0      3       1
1      2       4
2      0       5
3      1       9
4      5       6

In [13]:
data={'apple':[3,2,0,1,5],'orange':[1,4,5,9,6]}
df=pd.DataFrame.from_dict(data,orient='index')
print(df)

        0  1  2  3  4
apple   3  2  0  1  5
orange  1  4  5  9  6

In [15]:
data={'apple':[3,2,0,1,5],'orange':[1,4,5,9,6]}
df=pd.DataFrame.from_dict(data,orient='index',columns=['a','b','c','d','e'])
print(df)

        a  b  c  d  e
apple   3  2  0  1  5
orange  1  4  5  9  6

In [16]:
df=pd.read_csv('pandaexcel.csv')

In [17]:
print(df)

   apple  orange
0      1       6
1      2       7
2      3       5
3      4       2
4      5       1

In [19]:
df=pd.read_csv('pandaexcel.csv',index_col=0)
print(df)

       orange
apple
1           6
2           7
3           5
4           2
5           1

In [32]:
import json
import pandas as pd
df=pd.read_json('data.json',orient='index')
print(df)

             0
name  John Doe
age         30
city  New York

In [31]:
df.to_csv('pandaexcel.csv')

In [33]:
df.to_json('pandaexcel1.json')

In [34]:
movies_df=pd.read_csv('movies.csv')

In [35]:
print(movies_df)

       movieId                               title  \
0            1                    Toy Story (1995)
1            2                      Jumanji (1995)
2            3             Grumpier Old Men (1995)
3            4            Waiting to Exhale (1995)
4            5  Father of the Bride Part II (1995)
...        ...                                 ...
62418   209157                           We (2018)
62419   209159           Window of the Soul (2001)
62420   209163                    Bad Poems (2018)
62421   209169                 A Girl Thing (2001)
62422   209171      Women of Devil's Island (1962)

                                            genres
0      Adventure|Animation|Children|Comedy|Fantasy
1                       Adventure|Children|Fantasy
2                                   Comedy|Romance
3                             Comedy|Drama|Romance
4                                           Comedy
...                                            ...
62418                                        Drama
62419                                  Documentary
62420                                 Comedy|Drama
62421                           (no genres listed)
62422                       Action|Adventure|Drama

[62423 rows x 3 columns]

In [36]:
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [37]:
movies_df.head(10)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [38]:
movies_df.tail()

       movieId                           title                  genres
62418   209157                       We (2018)                   Drama
62419   209159       Window of the Soul (2001)             Documentary
62420   209163                Bad Poems (2018)            Comedy|Drama
62421   209169             A Girl Thing (2001)      (no genres listed)
62422   209171  Women of Devil's Island (1962)  Action|Adventure|Drama

In [39]:
movies_df.tail(2)

       movieId                           title                  genres
62421   209169             A Girl Thing (2001)      (no genres listed)
62422   209171  Women of Devil's Island (1962)  Action|Adventure|Drama

In [40]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62423 entries, 0 to 62422
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  62423 non-null  int64
 1   title    62423 non-null  object
 2   genres   62423 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.4+ MB

In [42]:
movies_df.shape

(62423, 3)

In [43]:
movies_df.describe()

             movieId
count   62423.000000
mean   122220.387646
std     63264.744844
min         1.000000
25%     82146.500000
50%    138022.000000
75%    173222.000000
max    209171.000000

In [46]:
movies_df['genres'].describe()

count     62423
unique     1639
top       Drama
freq       9056
Name: genres, dtype: object

In [52]:
data={'apple':[3,2,0,1,5],'orange':[1,4,5,9,6]}
df=pd.DataFrame(data)
print(df)
df['banana']=pd.Series([1,2,3,4,5])
print(df)

   apple  orange
0      3       1
1      2       4
2      0       5
3      1       9
4      5       6
   apple  orange  banana
0      3       1       1
1      2       4       2
2      0       5       3
3      1       9       4
4      5       6       5

In [54]:
df['mango']=df['apple']+df['banana']
print(df)

   apple  orange  banana  mango
0      3       1       1      4
1      2       4       2      4
2      0       5       3      3
3      1       9       4      5
4      5       6       5     10

In [55]:
del df['banana']
print(df)

   apple  orange  mango
0      3       1      4
1      2       4      4
2      0       5      3
3      1       9      5
4      5       6     10

In [56]:
print(df[2:4])

   apple  orange  mango
2      0       5      3
3      1       9      5

In [57]:
print(df[2:5])

   apple  orange  mango
2      0       5      3
3      1       9      5
4      5       6     10

In [58]:
print(df[2:6])

   apple  orange  mango
2      0       5      3
3      1       9      5
4      5       6     10

In [59]:
print(df[2:7])

   apple  orange  mango
2      0       5      3
3      1       9      5
4      5       6     10

In [60]:
print(df[:])

   apple  orange  mango
0      3       1      4
1      2       4      4
2      0       5      3
3      1       9      5
4      5       6     10

In [91]:
data1={'Pineapple':[1,8,6,3,7]}
df2=pd.DataFrame(data1)
print(df2)
df3=pd.concat([df,df2])
print(df3)
df3.dropna()
print(df3)

   Pineapple
0          1
1          8
2          6
3          3
4          7
   apple  orange  mango  Pineapple
0    3.0     1.0    8.0        NaN
1    2.0     4.0    9.0        NaN
2    0.0     5.0    3.0        NaN
3    1.0     9.0    4.0        NaN
4    5.0     6.0    2.0        NaN
0    NaN     NaN    NaN        1.0
1    NaN     NaN    NaN        8.0
2    NaN     NaN    NaN        6.0
3    NaN     NaN    NaN        3.0
4    NaN     NaN    NaN        7.0
   apple  orange  mango  Pineapple
0    3.0     1.0    8.0        NaN
1    2.0     4.0    9.0        NaN
2    0.0     5.0    3.0        NaN
3    1.0     9.0    4.0        NaN
4    5.0     6.0    2.0        NaN
0    NaN     NaN    NaN        1.0
1    NaN     NaN    NaN        8.0
2    NaN     NaN    NaN        6.0
3    NaN     NaN    NaN        3.0
4    NaN     NaN    NaN        7.0

In [105]:
import pandas as pd

df1 = pd.DataFrame({'Name':['A','B'], 'SSN':[10,20], 'marks':[90, 95] })
print(df1)
df2 = pd.DataFrame({'Name':['B','C'], 'SSN':[25,88], 'marks':[80, 97] })
print(df2)
df3 = pd.concat([df1, df2])
df3

  Name  SSN  marks
0    A   10     90
1    B   20     95
  Name  SSN  marks
0    B   25     80
1    C   88     97

  Name  SSN  marks
0    A   10     90
1    B   20     95
0    B   25     80
1    C   88     97

In [88]:
data1={'Pineapple':[1,8,6,3,7],'Jackfruit':[5,6,9,7,3],'papaya':[5,9,3,4,7]}
df2=pd.DataFrame(data1)
print(df2)

data={'apple':[3,2,0,1,5],'orange':[1,4,5,9,6],'mango':[8,9,3,4,2]}
df=pd.DataFrame(data)
print(df)

df3=pd.concat([df,df2],axis=0)
print(df3)

df3=pd.concat([df,df2],axis=1)
print(df3)

data2={'apple':[3,2,0,1,5],'orange':[1,4,5,9,6],'mango':[8,9,3,4,2]}
df3=pd.DataFrame(data)
print(df3)

df4=pd.concat([df,df3],axis=0)
print(df4)

   Pineapple  Jackfruit  papaya
0          1          5       5
1          8          6       9
2          6          9       3
3          3          7       4
4          7          3       7
   apple  orange  mango
0      3       1      8
1      2       4      9
2      0       5      3
3      1       9      4
4      5       6      2
   apple  orange  mango  Pineapple  Jackfruit  papaya
0    3.0     1.0    8.0        NaN        NaN     NaN
1    2.0     4.0    9.0        NaN        NaN     NaN
2    0.0     5.0    3.0        NaN        NaN     NaN
3    1.0     9.0    4.0        NaN        NaN     NaN
4    5.0     6.0    2.0        NaN        NaN     NaN
0    NaN     NaN    NaN        1.0        5.0     5.0
1    NaN     NaN    NaN        8.0        6.0     9.0
2    NaN     NaN    NaN        6.0        9.0     3.0
3    NaN     NaN    NaN        3.0        7.0     4.0
4    NaN     NaN    NaN        7.0        3.0     7.0
   apple  orange  mango  Pineapple  Jackfruit  papaya
0      3       1      8          1          5       5
1      2       4      9          8          6       9
2      0       5      3          6          9       3
3      1       9      4          3          7       4
4      5       6      2          7          3       7
   apple  orange  mango
0      3       1      8
1      2       4      9
2      0       5      3
3      1       9      4
4      5       6      2
   apple  orange  mango
0      3       1      8
1      2       4      9
2      0       5      3
3      1       9      4
4      5       6      2
0      3       1      8
1      2       4      9
2      0       5      3
3      1       9      4
4      5       6      2

In [104]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame({'Name':['A','B'], 'SSN':[10,20], 'marks':[90, 95] })
print(df1)
df2 = pd.DataFrame({'Name':['B','C'], 'SSN':[25,np.nan], 'marks':[80, 97] })
print(df2)
df3 = pd.concat([df1, df2])
df3
df4=df3.dropna(axis=0)
df4

  Name  SSN  marks
0    A   10     90
1    B   20     95
  Name   SSN  marks
0    B  25.0     80
1    C   NaN     97

  Name   SSN  marks
0    A  10.0     90
1    B  20.0     95
0    B  25.0     80

In [106]:
data1={'Pineapple':[1,8,6,3,7],'Jackfruit':[5,6,9,7,3],'papaya':[5,9,3,4,7]}
df2=pd.DataFrame(data1)
print(df2)

data={'apple':[3,2,0,1,5],'orange':[1,4,5,9,6],'mango':[8,9,3,4,2]}
df=pd.DataFrame(data)
print(df)

df3=pd.concat([df,df2],axis=0)
print(df3)

df3=pd.concat([df,df2],axis=1)
print(df3)

data2={'apple':[3,2,0,1,5],'orange':[1,4,5,9,6],'mango':[8,9,3,4,2]}
df3=pd.DataFrame(data)
print(df3)

df4=pd.concat([df,df3],axis=0)
print(df4.dropna(axis=0))

   Pineapple  Jackfruit  papaya
0          1          5       5
1          8          6       9
2          6          9       3
3          3          7       4
4          7          3       7
   apple  orange  mango
0      3       1      8
1      2       4      9
2      0       5      3
3      1       9      4
4      5       6      2
   apple  orange  mango  Pineapple  Jackfruit  papaya
0    3.0     1.0    8.0        NaN        NaN     NaN
1    2.0     4.0    9.0        NaN        NaN     NaN
2    0.0     5.0    3.0        NaN        NaN     NaN
3    1.0     9.0    4.0        NaN        NaN     NaN
4    5.0     6.0    2.0        NaN        NaN     NaN
0    NaN     NaN    NaN        1.0        5.0     5.0
1    NaN     NaN    NaN        8.0        6.0     9.0
2    NaN     NaN    NaN        6.0        9.0     3.0
3    NaN     NaN    NaN        3.0        7.0     4.0
4    NaN     NaN    NaN        7.0        3.0     7.0
   apple  orange  mango  Pineapple  Jackfruit  papaya
0      3       1      8          1          5       5
1      2       4      9          8          6       9
2      0       5      3          6          9       3
3      1       9      4          3          7       4
4      5       6      2          7          3       7
   apple  orange  mango
0      3       1      8
1      2       4      9
2      0       5      3
3      1       9      4
4      5       6      2
   apple  orange  mango
0      3       1      8
1      2       4      9
2      0       5      3
3      1       9      4
4      5       6      2
0      3       1      8
1      2       4      9
2      0       5      3
3      1       9      4
4      5       6      2